app/controllers/api/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def update
        @pokemon= Pokemon.find(params[:id])