app/views/api/pokemons/edit.json.jbuilder

SELECT "moves".* FROM "moves" INNER JOIN "poke_moves" ON "moves"."id" = "poke_moves"."move_id" WHERE "poke_moves"."pokemon_id" = $1  [["pokemon_id", 5]]
---
json.extract! @pokemon, :id, :number, :name, :image_url, :poke_type, :captured, :created_at, :updated_at
json.moves @pokemon.moves.map{ |move| move.name }